n5/src/Documents/ProjectsInvoice/ProjectsInvoice.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ProjectsInvoice</name>
  <registerRecords>AccumulationRegister.ProjectDebts</registerRecords>
  <registerRecords>AccumulationRegister.ProjectSales</registerRecords>
  <attributes>
    <name>Amount</name>
    <type>
      <types>DefinedType.Amount</types>
    </type>
  </attributes>
  <attributes>
    <name>Customer</name>
    <type>
      <types>CatalogRef.Organizations</types>
    </type>
  </attributes>
  <attributes>
    <name>Creator</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>Currency</name>
    <type>
      <types>CatalogRef.Currencies</types>
    </type>
  </attributes>
  <attributes>
    <name>Duration</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>InvoiceMethod</name>
    <type>
      <types>EnumRef.InvoiceMethods</types>
    </type>
  </attributes>
  <attributes>
    <name>Memo</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Minutes</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Notes</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>600</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>SalesTax1</name>
    <type>
      <types>CatalogRef.TaxItems</types>
    </type>
  </attributes>
  <attributes>
    <name>SalesTax2</name>
    <type>
      <types>CatalogRef.TaxItems</types>
    </type>
  </attributes>
  <attributes>
    <name>SalesTaxAmount</name>
    <type>
      <types>DefinedType.Amount</types>
    </type>
  </attributes>
  <attributes>
    <name>ServicesDescription</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>600</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Terms</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>TwoSalesTaxes</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Services</name>
    <attributes>
      <name>Amount</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>DiscountRate</name>
      <type>
        <types>DefinedType.Percent</types>
      </type>
    </attributes>
    <attributes>
      <name>Duration</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Employee</name>
      <type>
        <types>CatalogRef.Employees</types>
      </type>
    </attributes>
    <attributes>
      <name>HourlyRate</name>
      <type>
        <types>DefinedType.Rate</types>
      </type>
    </attributes>
    <attributes>
      <name>Minutes</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Project</name>
      <type>
        <types>CatalogRef.Projects</types>
      </type>
    </attributes>
    <attributes>
      <name>SalesTaxAmount1</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>SalesTaxAmount2</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>SalesTaxTotalAmount</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>TimeEntry</name>
      <type>
        <types>DocumentRef.TimeEntry</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

n5/src/InformationRegisters/ProjectInvoices/ProjectInvoices.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ProjectInvoices</name>
  <resources>
    <name>Invoice</name>
    <type>
      <types>DocumentRef.ProjectsInvoice</types>
    </type>
  </resources>
  <dimensions>
    <name>Project</name>
    <type>
      <types>CatalogRef.Projects</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

n5/src/InformationRegisters/TimeEntryInvoices/TimeEntryInvoices.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>TimeEntryInvoices</name>
  <resources>
    <name>Invoice</name>
    <type>
      <types>DocumentRef.ProjectsInvoice</types>
    </type>
  </resources>
  <resources>
    <name>Minutes</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Amount</name>
    <type>
      <types>DefinedType.Amount</types>
    </type>
  </resources>
  <dimensions>
    <name>TimeEntry</name>
    <type>
      <types>DocumentRef.TimeEntry</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

n5/src/Enums/InvoiceMethods/InvoiceMethods.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>InvoiceMethods</name>
  <enumValues>
    <name>ByTimeEntries</name>
  </enumValues>
  <enumValues>
    <name>ByProjects</name>
  </enumValues>
</mdclass:Enum>

n5/src/Documents/ProjectsInvoice/ObjectModule.bsl
#if ( Server or ThickClientOrdinaryApplication or ExternalConnection ) then

Procedure FillCheckProcessing ( Cancel, CheckedAttributes )
	
	checkTimeEntry ( CheckedAttributes );
	
EndProcedure

Procedure checkTimeEntry ( CheckedAttributes )
	
	if ( InvoiceMethod = Enums.InvoiceMethods.ByTimeEntries ) then
		CheckedAttributes.Add ( "Services.TimeEntry" );
	endif; 
	
EndProcedure 

Procedure Posting ( Cancel, PostingMode )
	
	env = Posting.GetParams ( Ref, RegisterRecords );
	Cancel = not Documents.ProjectsInvoice.Post ( env );
	
EndProcedure

Procedure UndoPosting ( Cancel )
	
	if ( InvoiceMethod = Enums.InvoiceMethods.ByProjects ) then
		unbindProjectsInvoicing ();
	else
		unbindTimeEntriesInvoicing ();
	endif; 
	
EndProcedure

Procedure unbindProjectsInvoicing ()
	
	tabe = getBindedProjects ();
	record = InformationRegisters.ProjectInvoices.CreateRecordManager ();
	for each row in tabe do
		record.Project = row.Project;
		record.Read ();
		if ( record.Selected () ) then
			record.Invoice = undefined;
			record.Write ();
		endif; 
	enddo; 
	
EndProcedure 

Function getBindedProjects ()
	
	s = "
	|select ProjectInvoices.Project as Project
	|from InformationRegister.ProjectInvoices as ProjectInvoices
	|where ProjectInvoices.Invoice = &Ref
	|";
	q = new Query ( s );
	q.SetParameter ( "Ref", Ref );
	return q.Execute ().Unload ();
	
EndFunction 

Procedure unbindTimeEntriesInvoicing ()
	
	tabe = getBindedInvoices ();
	record = InformationRegisters.TimeEntryInvoices.CreateRecordManager ();
	for each row in tabe do
		record.TimeEntry = row.TimeEntry;
		record.Read ();
		if ( record.Selected () ) then
			record.Invoice = undefined;
			record.Write ();
		endif; 
	enddo; 
	
EndProcedure 

Function getBindedInvoices ()
	
	s = "
	|select TimeEntryInvoices.TimeEntry as TimeEntry
	|from InformationRegister.TimeEntryInvoices as TimeEntryInvoices
	|where TimeEntryInvoices.Invoice = &Ref
	|";
	q = new Query ( s );
	q.SetParameter ( "Ref", Ref );
	return q.Execute ().Unload ();
	
EndFunction 

#endif
